---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Mechanical.IDuctFittingAndAccessoryPressureDropUIServer
source: html/ddf93922-4e08-ef9b-1107-2395316ed480.htm
---
# IDuctFittingAndAccessoryPressureDropUIServer Members

Returns the Id of the corresponding DB server for which this server provides an optional UI.